// alert("hello Artur")
// prompt("как вас зовут?")

// let myName = prompt("yor name"); 

// const arr = [ 
//     {},
//     4,
//     {
//         name: "wer",
//         vorname: "rew",
//         age: 34
//     } 
// ]

// console.log(arr);

// Цикл - повторяющиая последовательность действий

// Пока условие верно, то выполяется код в теле цикла
// - выполнить операцию несколько раз автоматически, вместо того, чтобы делать ее вручную
// - заполнить массив квадратами чисел из другого массива
// - рендерим(отображаем) несколько html карточек (div)


// for (let i = 0; i < 9; i++) {
//     console.log("Hello!");
// }

// for (let i = 0; i <= 10; i++) {
//     console.log(i);
    
// }

// -----------------------------------
// Массив объектов - структура данных, которая позволяет хранить документы из базы данных. 
/*
    const products = [
        {
            id: 1,
            name: "Iphone 14",
            price: 100000,
            category: "phone"
        },
        {
            id: 2,
            name: "Iphone 13",
            price: 90000,
            category: "mobile"
        },
        {
            id: 3,
            name: "Iphone 12",
            price: 80000,
            category: "phone"
        }
    ]
*/
// Вывести в консоль название в теге <h1><h1> // шаблонная строка - 
/*
    console.log(`<h1>${products[1].name} ${products[1].price}</h1>`) // интерполяция
*/
//  - <h1>Iphone 13 90000</h1>

/*
    Функция - блок кода, состоящий из различных команд. 
        С помощью функции можно отделять повторяющиеся команды, для того, чтобы постоянно их не писать заново
        Позволяет избавиться от лишнего дублирования кода

    Есть несколько способов создания функции
    1. function declaration
    2. function expression
    3. arrow function

    function fnName(param) {
        // действия // набор дейстий // алгоритм действий
    }
    fnName - имя функции. обычно в имени функции присутсвует глагол - действие
    param - параметры функции, аргументы функции. значения от которых зависит выполнение функций

    Вызов функции
    Пока функция не вызвана - она не работает
    Для того чтобы вызвать функцию, нужно записать - fnName()
*/
/*
    function sum(a, b) {
        console.log(a + b);
    }
    sum(4, 5)
*/

// --------------------------------------
// DOM
/*
console.log(document.body);

document.title = "DOM элементы"
*/













































